wegam/STM32F1xWorkSpace/Driver/Protocol/HC_PHY - 20180911.C
#include "HC_PHY.H"
#include "STM32_USART.H"
#include "TOOL.H"		//数据校验工具



#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间



//#include "STM32_GPIO.H"
//#include "STM32_SYS.H"
//#include "STM32_SYSTICK.H"
//#include "STM32_WDG.H"
//#include "STM32_USART.H"
//#include "STM32_PWM.H"

//#include "string.h"				//串和内存操作函数头文件
//#include "stm32f10x_dma.h"

//#define BufferSize	512
//unsigned char RS485BufferRU[1024]={0};		//上级数据接收缓存
//unsigned char RS485BufferTU[1024]={0};		//向上级发送数据缓存
//unsigned char RS485BufferRD[1024]={0};		//下级数据接收缓存
////unsigned char RS485BufferTD[1024]={0};
//unsigned char RS232BufferU[1024]={0};
//unsigned char RS232BufferD[1024]={0};

unsigned char	SerialU	=	0;							  //往上层上传流水号 0x01~0x7D 每次使用后加1(为了不与起始符和结束符冲突，流水号最大值为0x7D)
unsigned char	SerialD	=	0;							  //往下层下发流水号 0x01~0x7D 每次使用后加1(为了不与起始符和结束符冲突，流水号最大值为0x7D)

AckDef		ACKU;									//响应上级的应答
AckDef		ACKD;									//响应下级的应答

TransDef  TransU;     //向上传送缓冲区
TransDef  TransD;     //向下传送缓冲区

DataNodeDef	DataNodeU[MaxNetPerLayer+1];	//向上传输数据缓存队列
DataNodeDef	DataNodeD[MaxNetPerLayer+1];	//向下传输数据缓存队列，DataNodeD[0]存储广播消息

DataNodeDef SelfNode[SelfBuffSize];     //本地址需要处理的消息缓存(不需要转发给下一层的消息)


//StepDef UWORKSTEP;											  //往上级接口传送数据步骤
//StepDef DWORKSTEP[MaxNetPerLayer]={0};	  //下级接口工作步骤

RS485FrameDef RunFrame;

static HCSYSDef	HCSYS;
//unsigned short Lenth	=	0;
//unsigned short Lenth2	=	0;

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult HCBoradSet(const unsigned char Layer,const unsigned char id)
{
	HCResult res	  	=	  RES_OK;
	HCSYS.Layer			  = 	Layer;  //0-网关层，1-单元板层CabinetAddr，2-层控制板层LayerAddr，3,-驱动层SlotAddr
	HCSYS.SwitchAddr	= 	id;
	return res;
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: buffer  输入的数据缓存地址
              length  输入的数据长度
              UDflag  0-上层输入的数据
                      1-下层输入的数据
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult APISetDataProcess(const unsigned char *buffer,const unsigned short length)
{
	HCResult	res	=	RES_OK;
	unsigned char FarmeType	=	0;
	if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	FarmeType	=	FarmeCheck(buffer,length);
	if(1==FarmeType)
	{
		res = RS485ToRS485(buffer,length);     //单元板数据处理
	}
	else if(2	==	FarmeType)
	{
		res = RS232ToRS485(buffer,length);     //单元板数据处理
	}
	//===================================上层下发数据：目标地址与本地址相符，UDflag==0
//  switch(HCSYS.Layer)
//  {
//   case MBLayer:      //0-主板(网关板)
//        res = RS232ToRS485(buffer,length);     //单元板数据处理
//     break;
//   case CALayer:      //1-单元板
//        res = RS485ToRS485(buffer,length);     //单元板数据处理
//     break;
//   case LALayer:      //2-层板
//        res = RS485ToRS485(buffer,length);     //层板数据处理
//     break;
//   case SALayer:      //3-驱动板
//        res = RS485ToRS485(buffer,length);     //驱动板数据处理
//     break;
//   default:break;
//  }
//  if(RES_OK ==  res)
//    res	=	AckDataProcess(buffer,length,UDflag);

	//===================================其它跳过协议和地址的命令（透传）
	return res;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned char FarmeCheck(const void *buffer,const unsigned short length)
{
	RS485FrameDef *RS485Frame  	= NULL;
	RS232FrameDef *RS232Frame 	= NULL;
	RS485Frame	=	RS485Step1FindData(buffer,length);
	RS232Frame	=	RS232Step1FindData(buffer,length);
	if(NULL	!=	RS485Frame)	//非RS485
	{
		return 1;
	}
	else if(NULL	!=	RS232Frame)
	{
		return 2;
	}
	return 0;
}
/*******************************************************************************
*函数名			:	FindRS485Data
*功能描述		:	查找RS485数据在buffer中的起始地址并校验数据
*输入			: 
*返回值			:	NULL  未找到
					Addr  找到的起始地址
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
RS485FrameDef* RS485Step1FindData(const void *buffer,const unsigned short length)
{
	RS485FrameDef *RS485Frame  		    = NULL;
//	unsigned long *TargetDataAddr	= NULL;
//	unsigned long	*SourceDataAddr	= NULL;
	unsigned char	*Bcc8DataAddr	  = NULL;   //校验位地址
	unsigned char	*EndCodeAddr	  = NULL;   //结束符地址
	unsigned char *p							=	NULL;
 
	unsigned char TargetAddr	= 0;		//目标地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址,如果地址为0xFF表示为广播地址
	unsigned char SourceAddr	= 0;		//源地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址
	unsigned char	DataLength	= 0;		//消息内数据长度：包含地址位
  unsigned char FrameLength	= 0;		//消息帧总长度，从HeadCode到EndCode的字节数	
	unsigned char ValidLength	= 0;    //buffer中有效数据长度(从RS485头标识符开始后的数据为有效数据)
  unsigned char SourceBcc8  = 0;
	unsigned char SourceEndCode  = 0;
	unsigned char Bcc8      	= 0;    //异或校验
	unsigned char bass				=	0;
	
//	unsigned char NetLayer	  = 0;    //本板所在层级：0-网关层，1-单元板层CabinetAddr，2-层控制板层LayerAddr，3,-驱动层SlotAddr，数据来源为HCSYS.Layer
//	ErrCodeDef    ErrCode 	  = Err_None; //状态码/错误码

	if(NULL ==  buffer) //空地址
	{
		return NULL;
	}
	//=====================================最短帧长度要求
	RS485Frame =	(RS485FrameDef*)memchr(buffer,RS485HeadCode,length);		          //查找RS485Head1头标识符
	if(NULL ==  RS485Frame)
	{
		return NULL;      //未长度头标识符，退出
	}
  //=====================================

	bass   = (unsigned char)((unsigned long)RS485Frame-(unsigned long)buffer);  //获取起始帧头与缓存地址的偏差值
	ValidLength   = length-bass;     //去除前面无效数据	
  
	//-------------------------------------有效数据长度判断
	if(RS485MinFrameLen>ValidLength) 
	{
		return NULL;      //数据长度错误，退出
	}
	//-------------------------------------数据长度与buffer长度判断：最短帧长度+数据长度为有效长度+1字节校验位和1字节结束符
  FrameLength	  = DataLength+RS485StartFrameLen+1;	//1为结束符字节	
	if(FrameLength>ValidLength)
	{
		return NULL;      //数据个数+基本数据个数大于有效数据个数，退出
	}
	TargetAddr	=	RS485Frame->TargetAddr;
	SourceAddr	=	RS485Frame->SourceAddr;
	//=====================================地址校验
	if((0x00==TargetAddr)&&(0x00==SourceAddr))
	{
		return NULL;	//无地址数据，退出
	}
	//-------------------------------------上层下发时地址校验:上层下发时目标地址为本地址，源地址无效，广播地址为0xFF;下层上传时目标地址必须为0
	if((0x00!=TargetAddr)&&(!((0xFF==TargetAddr)||(HCSYS.SwitchAddr==TargetAddr))))
	{
		return NULL;	//非本板数据，退出
	}
	if(RS485Frame->DataLength>0)
	{
//		RS485Frame->data	=	(unsigned char*)(&(RS485Frame->DataLength)+(unsigned char)1);
//		RS485Frame->data	=	&DataNodeD[CabinetAddr].data[12]
//		RS485Frame->data	=	&(((unsigned char*)RS485Frame)[12]);
	}
	//=====================================数据校验BCC8：异或校验--计算长度为数据长度+地址前面部分长度包含DataLength字节
	SourceBcc8	=	RS485Frame->Bcc8;
	p	=	(unsigned char*)&RS485Frame->TargetAddr;
	Bcc8  = BCC8(p,RS485StartFrameLen+RS485Frame->DataLength-2);		//去年前两个字节（头标识和BCC8）
	if( Bcc8  !=  SourceBcc8)
	{
		return NULL;
	}
	//=====================================查找结束符(0x7F)
	SourceEndCode	=	(unsigned char)(((unsigned char*)RS485Frame)[RS485StartFrameLen+RS485Frame->DataLength]);
	if(RS485endCode !=  SourceEndCode)
	{
		return NULL;
	}
		return  RS485Frame;
}
 /*******************************************************************************
*函数名			:	RS485AckProcess
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
HCResult RS485Step2AckProcess(const void *buffer,const unsigned short length)
{
  HCResult	res	=	RES_OK;

	RS485FrameDef *RS485Frame  		    = NULL;
  AddrDef       *NetLayerAddr	  = NULL;   //地址域指针:Frame->Start.DataLength下一地址
  RS485FrameDef	*ACK            = NULL;
//	unsigned long *TargetDataAddr	= NULL;
//	unsigned long	*SourceDataAddr	= NULL;  
//	unsigned long	*Bcc8DataAddr	  = NULL;   //校验位地址
//	unsigned long	*EndCodeAddr	  = NULL;   //结束符地址
  

