wegam/STM32F1xWorkSpace/Driver/Protocol/HC_PHY - 20180911.C
	unsigned char TargetAddr	= 0;		//目标地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址,如果地址为0xFF表示为广播地址
	unsigned char SourceAddr	= 0;		//源地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址
  unsigned char SubAddr     = 0;    //获取下一级地址在地址域里的偏移
	unsigned char	DataLength	= 0;		//消息内数据长度：包含地址位
	unsigned char FrameLength	= 0;		//消息帧总长度，从HeadCode到EndCode的字节数
//	unsigned char ValidLength	= 0;    //buffer中有效数据长度(从RS485头标识符开始后的数据为有效数据)	
	unsigned char NetLayer	  = 0;    //本板所在层级：0-网关层，1-单元板层CabinetAddr，2-层控制板层LayerAddr，3,-驱动层SlotAddr，数据来源为HCSYS.Layer
//  unsigned char Bcc8      	= 0;    //异或校验
  
//	ErrCodeDef    ErrCode 	  = Err_None; //状态码/错误码
  
  RS485Frame = RS485Step1FindData(buffer,length); //查找RS485数据在buffer中的起始地址并校验数据
	if(NULL ==  RS485Frame)  //消息帧不符合
	{
		return RES_PARERR;
	}
  NetLayer    = HCSYS.Layer;
//  TargetAddr  = Frame->Start.TargetAddr;
//  SourceAddr  = Frame->Start.SourceAddr;
//  DataLength  = Frame->Start.DataLength;
  FrameLength = DataLength+RS485StartFrameLen+2;	//2为校验位和结束符
  //=====================================广播消息：不应答
  if(0xFF ==  RS485Frame->TargetAddr)   //0xFF广播不应答
  {
    return  RES_OK;
  }
  //=====================================检查状态位确认此消息是否为应答消息
//  if((CMD_ACK==Frame->Start.Cmd)&&(RS485AckFrameLen==FrameLength))
	if((RS485AckFrameLen== RS485Frame->DataLength+RS485StartFrameLen+1))
  {
		if(0	==	NetLayer)			//网关板
		{
			if(0	==	TargetAddr)	//下级应答
			{
				if(Err_None==RS485Frame->ErrCode) //无错误
					TransD.Length = 0;
			}
			else
			{
				if(Err_None==RS485Frame->ErrCode) //无错误
					TransU.Length = 0;
			}
		}
    //-------------------------------------上层对下应答:清除上传缓存
    else if(TargetAddr  ==  HCSYS.SwitchAddr)
    {
      if(Err_None==RS485Frame->ErrCode) //无错误
        TransU.Length = 0;
    }
    //-------------------------------------下层对上应答:清除下发缓存
    else
    {
      if(Err_None==RS485Frame->ErrCode) //无错误
        TransD.Length = 0;       
    }
    return RES_ACKMSG;
  }
  //=====================================非应答消息--创建应答消息：表示为数据或者命令传输消息，需要应答
	switch(HCSYS.Layer)
	{
		case 0:SubAddr	=	RS485Frame->CabinetAddr;
			break;
		case 1:SubAddr	=	RS485Frame->LayerAddr;
			break;
		case 2:SubAddr	=	RS485Frame->SlotAddr;
			break;
		case 3:
			break;
		default:break;
	}
 
  //-------------------------------------上层对下发送消息:检查相应下发缓冲区(DataNodeD)是否为空，非空应答忙
  if(HCSYS.SwitchAddr	==	RS485Frame->TargetAddr)   
  {
		unsigned char i	=	0;
		ACK =  (RS485FrameDef*)ACKU.Data;
		if(0	==	SubAddr)		//本层
		{
			ACK->ErrCode    = Err_FAULT_BUSY;
			res  = RES_NOTRDY;
			for(i=0;i<SelfBuffSize;i++)
			{
				if(0	==	SelfNode[i].Length)
				{
					ACK->ErrCode    = Err_None;
					res  = RES_OK;
					break;
				}
			}
		}
		else
		{
			if(DataNodeD[SubAddr].Length)     //当前下发缓存位有数据
			{       
				ACK->ErrCode     = Err_FAULT_BUSY;           //忙状态
				res  = RES_NOTRDY;
			}
			else
			{
				ACK->ErrCode    = Err_None;
				res  = RES_OK;
			}
		}		
		ACK->TargetAddr   = 0x00;
		ACK->SourceAddr   = HCSYS.SwitchAddr;
  }
  //-------------------------------------下层对上发送消息:检查相应下发缓冲区(DataNodeU)是否为空，非空应答忙
  else if(TargetAddr ==  0x00)        //上传消息
  {
    ACK =  (RS485FrameDef*)ACKD.Data;
     if(DataNodeU[SourceAddr].Length)       //当前上传缓存位有数据
     {
       ACK->ErrCode    = Err_FAULT_BUSY;
       res  = RES_NOTRDY;
     }
     else
     {       
       ACK->ErrCode    = Err_None;        
       res  = RES_OK;
     }    
    ACK->TargetAddr = RS485Frame->SourceAddr;
    ACK->SourceAddr = 0x00;           
  }
  ACK->HeadCode    	= RS485HeadCode;
  ACK->Serial      	= RS485Frame->Serial+1;
  ACK->Cmd        	= CMD_ACK;
  ACK->UserCode  		= RS485Frame->UserCode;
  ACK->DataLength 	= 0;
  ACK->Bcc8       	= BCC8((unsigned char*)&ACK->TargetAddr,7);
	ACK->CabinetAddr	=	RS485endCode;
  ACKU.FarmeLength  = RS485AckFrameLen;  
  return RES_OK;
}
/*******************************************************************************
* 函数名			:	RS485SaveData
* 功能描述		:	保存数据，根据源地址或者目的地址区分数据应该保存在上传缓冲区还是下发缓冲区
              如果下一级地址为0，表示此条消息针对本板使用，保存在本地缓存(SelfNode)待处理
              如果是上层下发到下层的消息，将目的地址修改为下层地址，源地址为0
              如果是下层上传到上层的消息，将源地址修改为本地地址，并将本地地址添加到地址域的相应位置
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult RS485Step3SaveData(const void *buffer,const unsigned short length)
{
	HCResult	res	=	RES_OK;

	RS485FrameDef *RceFrame  		  = NULL;
  AddrDef       *NetLayerAddr	  = NULL;   //地址域指针:Frame->Start.DataLength下一地址
  DataNodeDef	  *DataNode       = NULL;
//	unsigned long *TargetDataAddr	= NULL;
//	unsigned long	*SourceDataAddr	= NULL;
	unsigned char	*Bcc8DataAddr	  = NULL;   //校验位地址:数据地址后为校验位地址
	unsigned char *p							=	NULL;

//	unsigned long	*EndCodeAddr	  = NULL;   //结束符地址
  

	unsigned char TargetAddr	= 0;		//目标地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址,如果地址为0xFF表示为广播地址
//	unsigned char SourceAddr	= 0;		//源地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址
	unsigned char	DataLength	= 0;		//消息内数据长度：包含地址位
	unsigned char FrameLength	= 0;		//消息帧总长度，从HeadCode到EndCode的字节数
//	unsigned char ValidLength	= 0;    //buffer中有效数据长度(从RS485头标识符开始后的数据为有效数据)
//	unsigned char Bcc8      	= 0;    //异或校验
	unsigned char NetLayer	  = 0;    //本板所在层级：0-网关层，1-单元板层CabinetAddr，2-层控制板层LayerAddr，3,-驱动层SlotAddr，数据来源为HCSYS.Layer
	ErrCodeDef    ErrCode 	  = Err_None; //状态码/错误码

  //=====================================
	RceFrame = RS485Step1FindData(buffer,length); //查找RS485数据在buffer中的起始地址并校验数据
	if(NULL ==  RceFrame)  //消息帧不符合
	{
		return RES_PARERR;
	}
  //=====================================相关数据准备
  TargetAddr  = RceFrame->TargetAddr;
  ErrCode     = RceFrame->ErrCode;
  DataLength  = RceFrame->DataLength;
  FrameLength = RS485StartFrameLen+DataLength+2;
	
  NetLayer    = HCSYS.Layer;  
  NetLayerAddr  = (AddrDef*)((&RceFrame->DataLength)+1); //获取地址域起始坐标，Frame->Start.DataLength下一地址
  
  //=====================================上层下发消息：根据目标地址是否为本地址或者为广播地址，如果目标地址为0，则为下层往上发
  //-------------------------------------上层下发消息：地址为本地址或者为广播地址0xFF
  if((TargetAddr == HCSYS.SwitchAddr)||(TargetAddr == 0xFF))     //上层下发消息
  {
    //---------------------将数据放入相应数组缓冲区
    unsigned char SubAddr   = ((unsigned char*)NetLayerAddr)[NetLayer];  //获取下一级地址在地址域里的偏移
    RS485FrameDef *NewFrame = NULL;
		//---------------------如果是结点最后层或者此消息为本层消息，则将消息保存在待处理缓冲区
		if((3==NetLayer)||(0==SubAddr))
		{
			unsigned char i = 0;
      for(i=0;i<SelfBuffSize;i++)
      {
        DataNode  =  &SelfNode[i];
        if(0  ==  DataNode->Length) //缓存空
        {
          NewFrame  = (RS485FrameDef*)DataNode->data;
          memcpy(NewFrame,RceFrame,FrameLength);    //复制数据
          DataNode->Length  = FrameLength;
          return RES_OK;      //找到空位，保存完数据后退出保存函数
        }
      }
		}
    //---------------------此消息需要转发到下一层
    else if(0x00 != SubAddr)         //下一地址不为0表示此消息不属于本层，需要转发
    {
      if(0xFF ==  TargetAddr)   //广播消息:数组0存储广播消息
      {
        DataNode  =  &DataNodeD[0];
      }
      else
      {
        DataNode  =  &DataNodeD[SubAddr];
      }
      NewFrame  = (RS485FrameDef*)DataNode->data;
      memcpy(NewFrame,RceFrame,FrameLength);    //复制数据
      
