wegam/STM32F1xWorkSpace/Driver/Protocol/HC_PHY - 20180911.C
      NewFrame->TargetAddr	= SubAddr;
      NewFrame->SourceAddr	= 0x00;       //下发时，源地址必须为0 
      NewFrame->Serial    	= ++SerialD;
			NewFrame->Bcc8				=	0xF8;
			
      p	=	(unsigned char*)&NewFrame->TargetAddr;
			NewFrame->Bcc8				= BCC8(p,RS485StartFrameLen+RceFrame->DataLength-2);
      DataNode->Length  = RS485StartFrameLen+RceFrame->DataLength+1;		//1字节结束符
      
      return RES_OK;      //找到空位，保存完数据后退出保存函数
    }
    //---------------------此消息为本层消息
  }
	return res;
}
/*******************************************************************************
* 函数名			:	RS485ToRS485
* 功能描述		:	RS485转RS485 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult RS485ToRS485(const void *buffer,const unsigned short length)
{
	HCResult	res	=	RES_OK;

	RS485FrameDef *Frame  		    = NULL;
//	unsigned long *TargetDataAddr	= NULL;
//	unsigned long	*SourceDataAddr	= NULL;
//	unsigned long	*Bcc8DataAddr	  = NULL;   //校验位地址
//	unsigned long	*EndCodeAddr	  = NULL;   //结束符地址

//	unsigned char TargetAddr	= 0;		//目标地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址,如果地址为0xFF表示为广播地址
//	unsigned char SourceAddr	= 0;		//源地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址
//	unsigned char	DataLength	= 0;		//消息内数据长度：包含地址位
//	unsigned char FrameLength	= 0;		//消息帧总长度，从HeadCode到EndCode的字节数
//	unsigned char ValidLength	= 0;    //buffer中有效数据长度(从RS485头标识符开始后的数据为有效数据)
//	unsigned char Bcc8      	= 0;    //异或校验
//	unsigned char NetLayer	  = 0;    //本板所在层级：0-网关层，1-单元板层CabinetAddr，2-层控制板层LayerAddr，3,-驱动层SlotAddr，数据来源为HCSYS.Layer
//	ErrCodeDef    ErrCode 	  = Err_None; //状态码/错误码

  //=====================================
	Frame = RS485Step1FindData(buffer,length); //查找RS485数据在buffer中的起始地址并校验数据
	if(NULL ==  Frame)  //消息帧不符合
	{
		return RES_PARERR;
	}
  
  //=====================================
  res = RS485Step2AckProcess(Frame,length);
  if(RES_OK != res)
  {
    return res;
  }
  
	//=====================================保存数据
  res = RS485Step3SaveData(Frame,length);
  if(RES_OK != res)
  {
    return res;
  }
	//-------------------------------------上层下发消息
	return res;
}
/*******************************************************************************
*函数名			:	FindRS485Data
*功能描述		:	查找RS485数据在buffer中的起始地址并校验数据
*输入			: 
*返回值			:	NULL  未找到
					Addr  找到的起始地址
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
RS232FrameDef* RS232Step1FindData(const void *buffer,const unsigned short length)
{
	RS232FrameDef *RceFrame  		    = NULL;
	RS232FrameDef *Frame2  		    = NULL;
//	unsigned long *TargetDataAddr	= NULL;
//	unsigned long	*SourceDataAddr	= NULL;
	unsigned long	*Bcc8DataAddr	  = NULL;   //校验位地址
//	unsigned long	*EndCodeAddr	  = NULL;   //结束符地址

//	unsigned char TargetAddr	= 0;		//目标地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址,如果地址为0xFF表示为广播地址
//	unsigned char SourceAddr	= 0;		//源地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址
	unsigned char	DataLength	= 0;		//消息内数据长度：包含地址位
	unsigned char FrameLength	= 0;		//消息帧总长度，从HeadCode到EndCode的字节数
	unsigned char ValidLength	= 0;    //buffer中有效数据长度(从RS485头标识符开始后的数据为有效数据)
	unsigned char Bcc8      	= 0;    //异或校验
//	unsigned char NetLayer	  = 0;    //本板所在层级：0-网关层，1-单元板层CabinetAddr，2-层控制板层LayerAddr，3,-驱动层SlotAddr，数据来源为HCSYS.Layer
//	ErrCodeDef    ErrCode 	  = Err_None; //状态码/错误码

	if(NULL ==  buffer) //空地址
	{
		return NULL;
	}
	//=====================================最短帧长度要求
	RceFrame 	=	(RS232FrameDef*)memchr(buffer,RS232Head1,length);		          //查找RS485Head1头标识符
	Frame2 		=	(RS232FrameDef*)memchr(buffer,RS232Head2,length);		          //查找RS485Head1头标识符
	if(1 !=  ((unsigned long)Frame2-	(unsigned long)RceFrame))
	{
		return NULL;      //未长度头标识符，退出
	}
	ValidLength = (unsigned char)((unsigned long)RceFrame-(unsigned long)buffer);  //获取起始帧头与缓存地址的偏差值
	ValidLength = length-ValidLength;     //去除前面无效数据	
	//-------------------------------------有效数据长度判断
	if(RS232MinFrameLen>ValidLength) 
	{
		return NULL;      //数据长度错误，退出
	}
	//-------------------------------------数据长度与buffer长度判断：最短帧长度+数据长度为有效长度
	DataLength  = RceFrame->DataLength;
	FrameLength	= DataLength+RS232StartFrameLen;	//2为校验位和结束符
	if(FrameLength>ValidLength)
	{
		return NULL;      //数据个数+基本数据个数大于有效数据个数，退出
	}
	//=====================================数据校验BCC8：异或校验--计算长度为数据长度+地址前面部分长度包含DataLength字节
	if((0==DataLength)&&(0==RceFrame->Bcc8))
	{
		return  RceFrame;
	}
//	Bcc8DataAddr  = (unsigned long*)((unsigned long)RceFrame+RS232MinFrameLen);     //BCC8开始校验起始地址段
	Bcc8DataAddr  = (unsigned long*)&RceFrame->DataLength;     //BCC8开始校验起始地址段
	Bcc8DataAddr	=	(unsigned long*)((unsigned long)Bcc8DataAddr+1);
	Bcc8  = BCC8((unsigned char*)Bcc8DataAddr,DataLength);
	if( Bcc8  !=  RceFrame->Bcc8)
	{
		return NULL;
	}
		return  RceFrame;
}
/*******************************************************************************
*函数名			:	RS485AckProcess
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
HCResult RS232Step2AckProcess(const void *buffer,const unsigned short length)
{
  HCResult	res	=	RES_OK;

	RS232FrameDef *RS232Frame  		= NULL;
	RS232FrameDef	*RS232ACK     	= NULL;
	AddrDef				*Addr						=	NULL;	//地址段起始地址
	
	unsigned char*	p	=	NULL;

	unsigned char TargetAddr	= 0;		//目标地址：上层下发，目标地址为本地址，源地址无效，下层上发，目标地址必须为0，源地址为发送地址,如果地址为0xFF表示为广播地址
  
  RS232Frame = RS232Step1FindData(buffer,length); //查找RS485数据在buffer中的起始地址并校验数据
	if(NULL ==  RS232Frame)  //消息帧不符合
	{
		return RES_PARERR;
	}
	//=====================================检查状态位确认此消息是否为应答消息
  if((RS232AckFrameLen==length)&&(0==RS232Frame->DataLength))
  {
		TransU.Length = 0;
    return RES_ACKMSG;
  }
//	p	=	(unsigned char*)((unsigned long)RS232Frame+(unsigned long)11);
//	RS232Frame->data	=p;
//	RS232Frame->data	=(unsigned char*)((unsigned long)RS232Frame+(unsigned long)11);	
  //=====================================非应答消息--创建应答消息：表示为数据或者命令传输消息，需要应答
	TargetAddr	=	RS232Frame->CabinetAddr;			//单元板地址
  //-------------------------------------广播消息：存储在DataNodeD[0]
  if(0xFF ==  TargetAddr)   //0xFF广播不应答
  {
		return RES_OK;
  }
	//-------------------------------------检查相应缓存是否为空:空则应答，非空则不应答
	if(0==DataNodeD[TargetAddr].Length)		//非空
	{
		RS232ACK	=	(RS232FrameDef*)(ACKU.Data);
		memcpy(RS232ACK,RS232Frame,RS232AckFrameLen);
		RS232ACK->Bcc8					=	0;
		RS232ACK->DataLength		=	0;
		ACKU.FarmeLength	=	RS232AckFrameLen;
		res	=	RES_OK;
	}
	else
	{
		res  = RES_NOTRDY;
	}
  return res;
}
/*******************************************************************************
* 函数名			:	RS485SaveData
* 功能描述		:	保存数据，根据源地址或者目的地址区分数据应该保存在上传缓冲区还是下发缓冲区
              如果下一级地址为0，表示此条消息针对本板使用，保存在本地缓存(SelfNode)待处理
              如果是上层下发到下层的消息，将目的地址修改为下层地址，源地址为0
              如果是下层上传到上层的消息，将源地址修改为本地地址，并将本地地址添加到地址域的相应位置
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult RS232Step3SaveData(const void *buffer,const unsigned short length)
{
	HCResult	res	=	RES_OK;
	
	RS232FrameDef	*RS232Frame  		= NULL;
	RS485FrameDef	*RS485Frame  		= NULL;

